{
  "modelTopology": {
    "training_config": {
      "metrics": null,
      "loss": "categorical_crossentropy",
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "beta_1": 0.8999999761581421,
          "epsilon": 1e-8,
          "beta_2": 0.9990000128746033,
          "lr": 0.0010000000474974513,
          "decay": 0.0
        }
      },
      "sample_weight_mode": null,
      "loss_weights": null
    },
    "keras_version": "2.1.2",
    "model_config": {
      "class_name": "Model",
      "config": {
        "layers": [
          {
            "class_name": "InputLayer",
            "inbound_nodes": [],
            "config": {
              "dtype": "float32",
              "batch_input_shape": [null, 4],
              "name": "input_1",
              "sparse": false
            },
            "name": "input_1"
          },
          {
            "class_name": "Dense",
            "inbound_nodes": [[["input_1", 0, 0, {}]]],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "Dense1",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "sigmoid",
              "trainable": true,
              "kernel_regularizer": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "units": 10,
              "use_bias": true,
              "activity_regularizer": null
            },
            "name": "Dense1"
          },
          {
            "class_name": "Dense",
            "inbound_nodes": [[["Dense1", 0, 0, {}]]],
            "config": {
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "scale": 1.0,
                  "seed": null,
                  "mode": "fan_avg"
                }
              },
              "name": "Dense2",
              "kernel_constraint": null,
              "bias_regularizer": null,
              "bias_constraint": null,
              "activation": "softmax",
              "trainable": true,
              "kernel_regularizer": null,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "units": 3,
              "use_bias": true,
              "activity_regularizer": null
            },
            "name": "Dense2"
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "name": "model_1",
        "output_layers": [["Dense2", 0, 0]]
      }
    },
    "backend": "tensorflow"
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1"],
      "weights": [
        { "dtype": "float32", "shape": [4, 10], "name": "Dense1/kernel" },
        { "dtype": "float32", "shape": [10], "name": "Dense1/bias" }
      ]
    },
    {
      "paths": ["group2-shard1of1"],
      "weights": [
        { "dtype": "float32", "shape": [10, 3], "name": "Dense2/kernel" },
        { "dtype": "float32", "shape": [3], "name": "Dense2/bias" }
      ]
    }
  ]
}
